{
    "name": "UNITED STATES of America, Appellee, v. Mauricio Alfonso MAZZA-ALALUF, Defendant-Appellant",
    "opinions": [
        {
            "text": "REENA RAGGI, Circuit Judge:\nDefendant Mauricio Alfonso Mazza-Alaluf appeals from a judgment of conviction entered after a bench trial in the United States District Court for the Southern District of New York (P. Kevin Castel, Judge). The district court found Mazza-Alaluf guilty of conspiring to operate and actually operating an unlicensed money transmitting business, see 18 U.S.C. §§ 371, 1960(b)(1)(A), based on evidence that his company, Turismo Costa Brava, S.A. (“Turismo”), transmitted more than $200 million in New York, Illinois, and Michigan without obtaining appropriate state licenses. Mazza-Alaluf submits that the trial evidence was insufficient to support his conviction because, as a Chilean company whose office and employees were located in Chile, Turismo was neither (1) a United States “domestic financial institution” within the meaning of 31 U.S.C. § 5312; nor (2) required to obtain money transmitting licenses in any of the three states through which it transmitted millions of dollars. He further contends that his forty-two-month, below-Guidelines sentence was procedurally and substantively unreasonable.\nWe reject these arguments as without merit. Title 18 U.S.C. § 1960(b)(1)(A), under which Mazza-Alaluf was convicted for operating Turismo without appropriate state licenses, does not require the government to prove that the charged money transmitting business was a “domestic financial institution.” Further, the trial evidence was sufficient to permit a finding that Mazza-Alaluf operated a money transmitting business in New York, Illinois, and Michigan that required appropriate state licenses. Finally, Mazza-Alaluf s sentence was neither procedurally nor substantively unreasonable. Accordingly, we affirm the judgment of conviction.\nI. Background\nOn October 15, 2008, a grand jury in the Southern District of New York charged Mazza-Alaluf in a two-count, superseding indictment with conspiring to operate and actually operating an unlicensed money transmitting business, Turismo, in violation of 18 U.S.C. § 371 and § 1960. The indictment alleged that Turismo was an unlicensed money transmitting business because it (1) operated without appropriate state money transmitting licenses, see 18 U.S.C. § 1960(b)(1)(A); and (2) failed to comply with federal registration requirements for money transmitting businesses, see id. § 1960(b)(1)(B).\nPursuant to Fed.R.Crim.P. 23, Mazza-Alaluf waived his right to a jury trial. The district court held a two-day bench trial, after which it made thorough findings of fact, which are neither contested on appeal nor clearly erroneous. See United States v. Mazza-Alaluf, 607 F.Supp.2d 484 (S.D.N.Y.2009). Accordingly, we assume familiarity with the district court’s opinion and do not ourselves repeat its discussion of the facts of the case except as necessary to resolve Mazza-Alaluf s challenges to his conviction.\nAlthough the district court found Mazza-Alaluf guilty of both conspiring to operate and operating a money transmitting business without obtaining appropriate licenses in New York, Illinois, and Michigan, see 18 U.S.C. § 1960(b)(1)(A), it concluded that the government had not proved Mazza-Alaluf guilty of failing to comply with federal money transmitting registration requirements codified at 31 U.S.C. § 5330, see 18 U.S.C. § 1960(b)(1)(B). On this point, the district court found that Turismo’s actions in the United States made it a “domestic financial institution” under 31 U.S.C. § 5312. Nevertheless, because Turismo lacked an agent, agency, branch, or office “within the United States,” 31 C.F.R. § 103.11(n), (uu), it was not subject to federal registration regulations. The government does not appeal this determination.\nBecause the value of funds transmitted by Turismo in the three states was approximately $244 million, the Probation Office reported that Mazza-Alaluf s base offense level under the Sentencing Guidelines was thirty-four. See U.S.S.G. §§ 2X1.1, 2S1.3(a)(2), 2B1.1(b)(1)(0). The district court then granted a two-level reduction for acceptance of responsibility. See id. § 3E1.1(a). With a criminal history category of I, the district court calculated that Mazza-Alaluf faced a Guidelines range of 121 to 151 months’ imprisonment. Title 18 U.S.C. § 1960(a), however, provided a maximum prison term of five years on each count of conviction, thereby reducing the Guidelines range to a total of 120 months. See U.S.S.G. § 5Gl.l(a). Based on its evaluation of the 18 U.S.C. § 3553(a) factors, the court determined that a considerably lower prison term was warranted, and it sentenced Mazza-Alaluf to a total of forty-two months’ imprisonment, two years’ supervised release, and a $200 special assessment. Mazza-Alaluf timely filed this appeal.\nII. Discussion\nA. Mazzar-Alaluf s Sufficiency Challenge\nAlthough we review a challenge to the sufficiency of the evidence de novo, see United States v. Sabhnani, 599 F.3d 215, 241 (2d Cir.2010), defendant “bears a heavy burden because a reviewing court must consider the evidence ‘in the light most favorable to the prosecution’ and uphold the conviction if ‘any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.’ ” United States v. Aguilar, 585 F.3d 652, 656 (2d Cir.2009) (quoting Jackson v. Virginia, 443 U.S. 307, 319, 99 S.Ct. 2781, 61 L.Ed.2d 560 (1979) (emphasis in Jackson)). We apply this same deferential standard when we review a verdict rendered by a judge after a bench trial. See United States v. Pierce, 224 F.3d 158, 164 (2d Cir.2000); United States v. Zabare, 871 F.2d 282, 284, 286 (2d Cir.1989). To the extent Mazza-Alaluf's challenge presents an issue of statutory construction, however, our review is de novo. See United States v. Shyne, 617 F.3d 103, 106 (2d Cir.2010).\n1. Section 1960(b)(1)(A) Does Not Require Proof that the Charged Money Transmitting Business Was a “Domestic Financial Institution” Covered by Federal Reporting Requirements\nTitle 18 U.S.C. § 1960(a) makes it a crime knowingly to “conduct[ ], control[ ], manage[], supervisee ], direct[], or own[] all or part of an unlicensed money transmitting business.” Section 1960(b)(1), in turn, states as follows:\n[T]he term “unlicensed money transmitting business” means a money transmitting business which affects interstate or foreign commerce in any manner or degree and—\n(A)is operated without an appropriate money transmitting license in a State where such operation is punishable as a misdemeanor or a felony under State law, whether or not the defendant knew that the operation was required to be licensed or that the operation was so punishable;\n(B) fails to comply with the money transmitting business registration requirements under section 5330 of title 31, United States Code, or regulations prescribed under such section; or\n(C) otherwise involves the transportation or transmission of funds that are known to the defendant to have been derived from a criminal offense or are intended to be used to promote or support unlawful activity[.]\n18 U.S.C. § 1960(b)(1). Although the government argued at trial that Mazza-Alaluf was guilty under both § 1960(b)(1)(A) for failing to comply with state licensing requirements and § 1960(b)(1)(B) for failing to comply with federal registration requirements, the district court was persuaded by only the former argument.\nIn mounting a sufficiency challenge to his § 1960(b)(1)(A) convictions, Mazza-Alaluf does not contest that he owned and managed Turismo. Nor does he challenge the evidence of money transmittals. Rather, Mazza-Alaluf maintains that his convictions must be vacated because the evidence was insufficient to demonstrate that Turismo was a money transmitting business as defined in 31 U.S.C. § 5330(d)(1)(B). That section, referenced in 18 U.S.C. § 1960(b)(1)(B), defines a “money transmitting business” as any business required to file reports under 31 U.S.C. § 5313, which in turn relates to “domestic financial institution[s].” Title 31 U.S.C. § 5312(b)(1) states that the term “domestic financial institution,” for purposes of that subchapter, “applies] to an action in the United States of a financial agency or institution.” Because Mazza-Alaluf raised his Title 31 argument in the district court only as it pertained to the government’s reliance on a § 1960(b)(1)(B) theory of guilt, we review his recasting of that claim to challenge his § 1960(b)(1)(A) conviction for plain error, and we identify none here. See Fed.R.Crim.P. 52(b); see also United States v. Needham, 604 F.3d 673, 678 (2d Cir.2010) (recognizing that plain error analysis requires (1) error, (2) that is plain, (3) that affects defendant’s substantial rights, and (4) that seriously affects fairness, integrity, or public reputation of judicial proceedings).\nMazza-Alaluf contends that for him to be guilty of violating § 1960(b)(1)(A), the government was required to prove that Turismo was a “money transmitting business,” as defined by 31 U.S.C. § 5330(d)(1)(B), because that statute contains the only definition of “money transmitting business” in the United States Code. We are not persuaded. Section 5330(d) states that its definitions apply only “[f]or purposes of this section.” This court has declined to apply a definition from one statutory provision to another under such circumstances. See United States v. Savin, 349 F.3d 27, 36-37 (2d Cir.2003) (declining to apply Internal Revenue Code definition of “foreign investment company” to Sentencing Guidelines context where Code “specifically limit[ed] its definition to the subchapter in which it appeared]” and provision used term for different purposes). Further, importing the § 5330(d)(1)(B) definition of “money transmitting business” into § 1960 would render superfluous the latter statute’s definition of two of the three words contained in that term. See 18 U.S.C. § 1960(b)(2) (defining “money transmitting” to mean “transferring funds on behalf of the public by any and all means including but not limited to transfers within this country or to locations abroad by wire, check, draft, facsimile, or courier”). Such an approach to statutory construction would fall further afoul of well-settled canons of statutory interpretation. See, e.g., Corley v. United States, — U.S.-, 129 S.Ct. 1558, 1566, 173 L.Ed.2d 443 (2009) (noting that “statute should be construed so that effect is given to all its provisions, so that no paid will be inoperative or superfluous, void or insignificant” (internal quotation marks omitted)); Puello v. Bureau of Citizenship & Immigration Servs., 511 F.3d 324, 331 (2d Cir.2007) (refusing to apply one statutory provision’s definition of term to another statutory provision where former’s definition “would render [part of latter’s] definition superfluous”). Thus, we identify no plain error in the district court’s failure to rely on the 31 U.S.C. § 5330(d)(1)(B) definition in finding Mazza-Alaluf guilty under 18 U.S.C. § 1960(b)(1)(A).\nAccordingly, we conclude that the evidence was sufficient to permit a reasonable factfinder to conclude that Mazza-Alaluf was guilty under § 1960(b)(1)(A) without respect to whether or not Turismo was a “domestic financial institution” operating as a “money transmitting business” according to definitions in Title 31.\nIn any event, we note that even if § 1960(b)(1)(A) applied only to money transmitting businesses qualifying as “domestic financial institutions,” as defined in Title 31, Mazza-Alalufs sufficiency challenge would still fail because the district court found with respect to § 1960(b)(1)(B) that, based on its substantial activities in the United States, discussed infra at [9-14], Turismo was a domestic financial institution within the meaning of 31 U.S.C. § 5312(b)(1). This determination was not erroneous because Turismo was a “financial institution,” see 31 U.S.C. § 5312(a)(2)(R) (defining “financial institution” as, inter alicL, “a licensed sender of money or any other person who engages as a business in the transmission of funds”), that engaged in “action[s] in the United States,” id. § 5312(b)(1) (defining “domestic financial institution”); see also United States v. Bah, 574 F.3d 106, 112 (2d Cir.2009) (observing that federal money transmitting statute “is designed, inter alia, to prevent the movement of funds”).\n2. The Evidence Was Sufficient To Permit the District Court To Find that Mazza-Alaluf Operated a Money Transmitting Business in New York, Illinois, and Michigan Without Appropriate State Licenses\nAlthough Mazza-Alaluf does not dispute that Turismo was a money transmitting business according to the plain meaning of the term or that Turismo transferred hundreds of millions of dollars from its bank accounts in New York, Illinois, and Michigan, he maintains that Turismo was not subject to those states’ licensing requirements because his business “was, in every sense, Chilean to its core.” Appellant’s Br. at 33. This argument fails because record evidence that Turismo conducted substantial money transmitting business in the three states permitted the district court to find that Turismo was required to be licensed under the applicable local laws.\na. New York\nUnder New York law, “[n]o person shall engage in ... the business of receiving money for transmission or transmitting the same, without a license therefor.” N.Y. Banking Law § 641(1). Violations are punishable as misdemeanors or felonies depending on the amount of money involved. See id. § 650(2).\nIn 1999 and 2000, Turismo opened two accounts at Israel Discount Bank in New York City that it used to distribute funds by issuing cheeks and making transfers to customers who also maintained accounts at that bank. Between 2000 and 2003, Turismo engaged a New York-based money transmitter, Beacon Hill Service Corporation, which opened an account in Turismo’s name at Chase Manhattan Bank in New York. Beacon Hill received checks from Turismo’s New York accounts and wire transfers from individuals in Florida and South America, and it then used those funds to make over 1,000 outgoing wire transmittals at Turismo’s direction. Mazza-Alaluf himself describes these accounts as having “received and transmitted tens of millions of dollars.” Appellant’s Br. at 22 (emphasis added). Viewing the record of Turismo’s substantial New York money transfers in the light most favorable to the government, we conclude that this evidence was sufficient to permit the district court to find that Turismo was “engaged in the business of’ transmitting money in New York despite having its principal place of business in Chile.\nOur recent decision in United States v. Bah, 574 F.3d 106, is not to the contrary. Unlike the defendant in Bah — who argued that he received money in New York, transported it to New Jersey, and then transmitted money from New Jersey where he was licensed to operate a money transmitting business — Mazza-Alaluf carried cash into the United States from Chile, which cash was eventually deposited in Turismo’s United States bank accounts for transmission in New York and the other states at issue. See id. at 114 n. 6 (holding that statute prohibits unlicensed transfer, not transport, of funds). Accordingly, because the evidence shows that Turismo used New York banking facilities to transmit enormous sums of money in the state, the district court correctly ruled that he was required to obtain an appropriate New York license.\nb. Illinois\nIn Illinois, it is a felony for a person to “engage in this State in the business of ... transmitting money ... without first obtaining a license under this Act.” 205 111. Comp. Stat. 657/10, 90. In September 2003, Turismo opened an account with Harris Savings and Trust in Chicago, Illinois. Between 2003 and 2006, approximately $200 million to $240 million were deposited into and transferred from that account. Further, Turismo maintained a lockbox at Harris, through which hundreds of checks were cleared and the proceeds transmitted pursuant to the instructions of Turismo’s customers. Mazza-Alaluf concedes that “Turismo used [its] online account with Harris to transmit funds via wire transfers,” that it “received tens of millions of dollars via wire transfers and checks sent to its Harris lock box,” and that “hundreds of checks drawn on United States banks by United States account holders went through the Harris lock box.” Appellant’s Br. at 31 (emphasis added). Because Illinois law defines money transmitters covered by its licensing requirements as persons either “located in or doing business in this State,” 205 Ill. Comp. Stat. 657/5 (emphasis added), and Mazza-Alaluf concedes that such persons are subject to the licensing requirement “even if they are not physically located in Illinois,” Appellant’s Br. at 32, we conclude that sufficient evidence supports Mazza-Alaluf s conviction for operating a money transmitting business without an appropriate Illinois license.\nc. Michigan\nFinally, in Michigan, it is a felony for a person to “provide money transmission services in this state ... without a license.” Mich. Comp. Law §§ 487.1011, 487.1042(3). In December 2006, after Harris closed Turismo’s Illinois account, Mazza-Alaluf and his cousin Luis Mazza-Olmos, a co-owner of Turismo, opened an account at the Chase Manhattan Bank branch in Dearborn, Michigan. To open the account, Turismo provided the United States address of Mazza-Olmos’s Michigan accountant. Again, Mazza-Alaluf acknowledges that the Michigan account “took in approximately $42 million, and sent out approximately the same amount to other recipients.” Appellant’s Br. at 36.\n“Money transmission services” are defined under Michigan law to include, inter alia, “receiving money or monetary value for transmission.” Mich. Comp. Law § 487.1003(c). Mazza-Alaluf asserts that the transactions were directed from Chile and merely cleared through the Michigan account. Therefore, he contends, the receipt of money actually occurred in Chile because Turismo communicated with its customers, accepted their orders, and executed the wire transfers from there. We disagree. The common meaning of “receive” is “to take possession or delivery of.” Webster’s Third New International Dictionary 1894 (1986). Here, the district court specifically found that Turismo “took in approximately $42 million” in Michigan, United States v. Mazza-Alaluf, 607 F.Supp.2d at 492, thereby satisfying the definition of receive.\nIn construing the New York money transmitting statute, however, we have held that 18 U.S.C. § 1960 does not incorporate into federal law that part of the state statute that prohibits engaging in the business of receiving money for transmission without a license. See United States v. Bah, 574 F.3d at 109; see also id,, at 112 (“The federal statute does not mention the receipt of money for transmission.” (emphasis in original)). Although Mazza-Alaluf focuses his argument on the theory that Turismo never received money in Michigan, the district court correctly based its finding that Turismo was required to obtain a Michigan license on the fact that it “moved approximately $42 million through an account in the state.” United States v. Mazzar-Alaluf 607 F.Supp.2d at 492; see also 18 U.S.C. § 1960(b)(2) (defining “mon ey transmitting” as “transferring funds on behalf of the public by any and all means”). Viewing the evidence in the light most favorable to the government, we conclude that because substantial amounts of money were actually transmitted in Michigan, Mazza-Alaluf “provide[d] money transmission services” subjecting Turismo to that state’s licensing requirements. Mich. Comp. Law § 487.1011.\nIn sum, we conclude that sufficient evidence supports Mazza-Alalufs convictions under 18 U.S.C. § 1960(b)(1)(A) for conspiring to operate and operating a money transmitting business without appropriate state licenses.\nB. Mazzar-Alalufs Sentencing Challenge\n1. Jurisdiction\nBecause Mazza-Alaluf finished serving his forty-two-month term of imprisonment on April 16, 2010, and is now awaiting removal, the government submits that his sentencing challenge is moot. “An appellate challenge to a criminal sentence is rendered moot when the defendant has been released from prison and when there is either no possibility or only a remote and speculative possibility that the district court could or would impose a reduced term of supervised release were we to remand for resentencing.” United States v. Key, 602 F.3d 492, 494 (2d Cir.2010) (internal quotation marks and brackets omitted). In arguing mootness, the government contends that Mazza-Alaluf has “ ‘only a quixotic chance of legally returning to the United States’ to serve the remainder of his term of supervised release.” United States v. Williams, 475 F.3d 468, 479 n. 6 (2d Cir.2007) (quoting United States v. Mercurris, 192 F.3d 290, 294 (2d Cir.1999)).\nIn Mercurris, we concluded that a defendant who had already been deported, see 192 F.3d at 293, stood only a “quixotic” chance of returning to the United States because his drug convictions rendered him an inadmissible alien, see id. at 294-95 (citing 8 U.S.C. § 1182(a)(2)(A)(i)(II), (a)(2)(C)). By contrast, Mazza-Alaluf is still awaiting removal, and the government does not cite any similar reentry proscription on persons convicted of money transmitting. But cf. 8 U.S.C. § 1182(a)(2)(I) (stating that aliens who have engaged in money laundering proscribed by 18 U.S.C. § 1956 and § 1957 are inadmissible). Further, as two years’ supervised release was not the statutory minimum for the crimes of conviction, the district court could presumably lower Mazza-Alalufs remaining, non-custodial sentence were we to remand. Cf. United States v. Key, 602 F.3d at 494.\nAccordingly, we conclude that we have jurisdiction to address the merits of Mazza-Alalufs sentencing challenge.\n2. Mazzar-Alalufs Sentence Was Reasonable\nWe review Mazza-Alalufs sentence for reasonableness, see Kimbrough v. United States, 552 U.S. 85, 90-91, 128 S.Ct. 558, 169 L.Ed.2d 481 (2007), “a particularly deferential form of abuse-of-discretion review,” United States v. Cavera, 550 F.3d 180, 188 n. 5 (2d Cir.2008) (en banc). “Reasonableness review involves consideration of both the length of the sentence (substantive reasonableness) and the procedures used to arrive at the sentence (procedural reasonableness).” United States v. Canova, 485 F.3d 674, 679 (2d Cir.2007). In undertaking this review, we focus on the reasonableness of Mazza-Alalufs forty-two-month term of imprisonment, as that is the only part of the sentence he challenges.\nMazza-Alaluf principally contends that his sentence is procedurally unreason able because the district court did not adequately consider “the need to avoid unwarranted sentence disparities among defendants with similar records who have been found guilty of similar conduct.” 18 U.S.C. § 3553(a)(6). Specifically, Mazza-Alaluf asserts that his sentence should have been lower because (1) in an unrelated case, the defendant was sentenced to one year of probation, and (2) Mazza-Alaluf would not have faced federal criminal sanctions had Turismo operated in a state that did not proscribe money transmitting. We are not persuaded.\nThe district court here stated that it had considered § 3553(a)(6) and, indeed, imposed a sentence significantly below the Guidelines range. In these circumstances, where Mazza-Alalufs claimed unwarranted disparity is based on a comparison to a single defendant’s sentence in a completely unrelated case and to a hypothetical situation in which he would not have committed any federal crime at all, we identify no procedural error in finding that there was no unwarranted sentencing disparity. See, e.g., United States v. Keller, 539 F.3d 97, 101 (2d Cir.2008) (disavowing “formulaic requirements” or “robotic incantations” to discharge § 3553(a) duty). Nor did the district court err by not specifically addressing the lesser sentence imposed in the unrelated money transmitting ease cited by Mazza-Alaluf. See Rita v. United States, 551 U.S. 338, 356, 127 S.Ct. 2456, 168 L.Ed.2d 203 (2007) (“Sometimes a judicial opinion responds to every argument; sometimes it does not.... The law leaves much, in this respect, to the judge’s own professional judgment.”); United States v. Villafuerte, 502 F.3d 204, 210 (2d Cir.2007) (“[W]e do not insist that the district court address every argument the defendant has made .... ”).\nTo the extent Mazza-Alaluf asserts that the district court failed to accord the § 3553(a)(6) factor sufficient mitigating weight, he raises a substantive challenge. See United States v. Cavera, 550 F.3d at 191. Because the district court has a particular advantage in assessing the evidence and the defendant, we accord it considerable deference in assigning weight to relevant sentencing factors. See id.; see also United States v. Jones, 531 F.3d 163, 170-71 (2d Cir.2008) (discussing institutional advantages of district court). Only rarely will we conclude that weights have been assigned that remove a sentence from the broad range of permissible sentencing choices available to the district court. See United States v. Cavera, 550 F.3d at 188-89; cf. United States v. Dorvee, 616 F.3d 174, 183 (2d Cir.2010) (observing that “substantive reasonableness review is intended to provide a backstop against sentences that are shockingly high, shockingly low, or otherwise unsupportable as a matter of law” in concluding that sentence was substantively unreasonable (internal quotation marks omitted)). This is not such a case. The scope of the defendant’s activities — involving the unlicensed transmittal of more than $200 million — reasonably supported a forty-two-month incareeratory sentence even if various mitigating factors indicated to the district court that the sentence should not be as high as the 120-month statutory maximum that became his Guidelines range.\nAccordingly, we identify no procedural or substantive unreasonableness in the challenged sentence.\nIII. Conclusion\nTo summarize, we conclude:\n1. Title 18 U.S.C. § 1960(b)(1)(A), which makes it a crime to operate a money transmitting business without appropriate state licenses, does not require the government to prove that the charged business was a “domestic financial institution,” as defined in those parts of Title 31 governing federal reporting requirements for such institutions.\n2. The trial evidence was sufficient to permit a finding that Mazza-Alaluf operated an unlicensed money transmitting business in New York, Illinois, and Michigan because Turismo transmitted hundreds of millions of dollars on behalf of its customers from accounts in those states.\n3. Mazza-Alaluf s sentencing challenge is not moot because he has neither served his remaining two-year term of supervised release nor been deported, and the government directs us to no statutory barrier to re-entry based on the crime of operating an unlicensed money transmitting business. Nevertheless, Mazza-Alaluf s below-Guidelines sentence is reasonable.\nAffirmed.",
            "author": "REENA RAGGI, Circuit Judge",
            "type": "majority"
        }
    ],
    "cites_to": [
        {
            "type": null,
            "case_ids": [],
            "cite": "550 F.3d at 188"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "607 F.Supp.2d at 492"
        },
        {
            "type": null,
            "case_ids": [
                3676709
            ],
            "cite": "574 F.3d 106"
        },
        {
            "type": null,
            "case_ids": [
                3768074
            ],
            "cite": "616 F.3d 174"
        },
        {
            "type": null,
            "case_ids": [
                5870614
            ],
            "cite": "531 F.3d 163"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "550 F.3d at 191"
        },
        {
            "type": null,
            "case_ids": [
                5523220
            ],
            "cite": "502 F.3d 204"
        },
        {
            "type": null,
            "case_ids": [
                3573000
            ],
            "cite": "168 L.Ed.2d 203"
        },
        {
            "type": null,
            "case_ids": [
                3573000
            ],
            "cite": "127 S.Ct. 2456"
        },
        {
            "type": null,
            "case_ids": [
                3573000
            ],
            "cite": "551 U.S. 338"
        },
        {
            "type": null,
            "case_ids": [
                3121455
            ],
            "cite": "539 F.3d 97"
        },
        {
            "type": null,
            "case_ids": [
                4077319
            ],
            "cite": "485 F.3d 674"
        },
        {
            "type": null,
            "case_ids": [
                5741803
            ],
            "cite": "550 F.3d 180"
        },
        {
            "type": null,
            "case_ids": [
                3675682
            ],
            "cite": "169 L.Ed.2d 481"
        },
        {
            "type": null,
            "case_ids": [
                3675682
            ],
            "cite": "128 S.Ct. 558"
        },
        {
            "type": null,
            "case_ids": [
                3675682
            ],
            "cite": "552 U.S. 85"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "602 F.3d at 494"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "192 F.3d at 293"
        },
        {
            "type": null,
            "case_ids": [
                11568199
            ],
            "cite": "192 F.3d 290"
        },
        {
            "type": null,
            "case_ids": [
                3752951
            ],
            "cite": "475 F.3d 468"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "602 F.3d 492"
        },
        {
            "type": null,
            "case_ids": [],
            "cite": "574 F.3d at 109"
        },
        {
            "type": null,
            "case_ids": [
                4068515
            ],
            "cite": "511 F.3d 324"
        },
        {
            "type": null,
            "case_ids": [
                3653414
            ],
            "cite": "173 L.Ed.2d 443"
        },
        {
            "type": null,
            "case_ids": [
                3653414
            ],
            "cite": "129 S.Ct. 1558"
        },
        {
            "type": null,
            "case_ids": [
                9064287
            ],
            "cite": "349 F.3d 27"
        },
        {
            "type": null,
            "case_ids": [
                6053907
            ],
            "cite": "604 F.3d 673"
        },
        {
            "type": null,
            "case_ids": [
                3771690
            ],
            "cite": "617 F.3d 103"
        },
        {
            "type": null,
            "case_ids": [
                10528877
            ],
            "cite": "871 F.2d 282"
        },
        {
            "type": null,
            "case_ids": [
                11236128
            ],
            "cite": "224 F.3d 158"
        },
        {
            "type": null,
            "case_ids": [
                6182418
            ],
            "cite": "61 L.Ed.2d 560"
        },
        {
            "type": null,
            "case_ids": [
                6182418
            ],
            "cite": "99 S.Ct. 2781"
        },
        {
            "type": null,
            "case_ids": [
                6182418
            ],
            "cite": "443 U.S. 307"
        },
        {
            "type": null,
            "case_ids": [
                3480700
            ],
            "cite": "585 F.3d 652"
        },
        {
            "type": null,
            "case_ids": [
                4224029
            ],
            "cite": "599 F.3d 215"
        },
        {
            "type": null,
            "case_ids": [
                4207056
            ],
            "cite": "607 F.Supp.2d 484"
        }
    ],
    "name_abbreviation": "United States v. Mazza-Alaluf",
    "court": "2d-cir-2",
    "citations": [
        {
            "type": "official",
            "case_ids": [],
            "cite": "621 F.3d 205"
        }
    ],
    "jurisdiction": "us",
    "last_page": 215,
    "first_page": 205,
    "decision_date": "2010-09-22"
}